<template>
    <div>
        <div class="container">
            <div style="height: 600px;margin-left: 200px">
                <el-steps direction="vertical" :active=number id="mainStep">

                    <el-step title="文件上传">
                        <template slot="description">

                        <el-upload
                            class="upload-demo"
                            accept=".zip"
                            action="uploadZip"
                            ref="refFile"
                            :auto-upload="false"
                            :on-change="uploadZip"
                            :on-preview="handlePreview"
                            :on-remove="handleRemove"
                            :before-remove="beforeRemove"
                            :before-upload="beforeAvatarUpload"
                            :on-exceed="handleExceed"
                            :limit="1"
                            :file-list="fileList">
                            <el-button size="small" type="primary"
                                >文件上传</el-button>
<!--                            <el-button style="margin-left: 10px;" size="small" type="success" @click="uploadZip">上传到服务器</el-button>-->
                            <div slot="tip" class="el-upload__tip">只能上传zip文件，且不超过500kb {{message}}</div>
                        </el-upload>


                        </template>
                    </el-step>

                    <el-step title="数据预处理">
                        <template slot="description">

                        <div class="ellipse">
                            <div class="models">数据预处理</div>
                        </div>
                        </template>
                    </el-step>

                    <el-step title="模型调用和预测" description="这是一段很长很长很长的描述性文字">
                        <template slot="description">
                            <div class="ellipse">
                                <div class="models">模型调用和预测</div>
                            </div>
                        </template>
                    </el-step>

                </el-steps>
            </div>

            <br>
            <el-row style="margin-top: 200px">

                <el-col :span="23">

                    <el-card shadow="hover" class="mgb20" style="height:850px;">
                        <div class="user-info">
                            特征数据提取结果
                        </div>
                        <div style="width: 1000px;padding-left: 40px;padding-top: 20px;margin-top:10px;background:#c7ddef">
                            <el-table
                                :data="TableData"
                                stripe
                                style="width: 100%"
                                border
                            >
                                <el-table-column
                                    v-for="info in TestHeader" :key="info.key"
                                    :property="info.key"
                                    :label="info.label"
                                >
                                    <template slot-scope="scope">
                                        {{scope.row[scope.column.property]}}
                                    </template>
                                </el-table-column>
                            </el-table>
                        </div>

                    </el-card>

                    <el-card shadow="hover" style="height:700px;">
                        <div slot="header" class="clearfix">
                            <span>模型预测结果</span>
                        </div>
                        <div style="width: 1000px;padding-left: 0;padding-top: 20px;margin-top:10px;background:#c7ddef">
                            <div id="echart1" style="width: 1000px;height: 600px;padding-top:20px;margin-left: 10px;"></div>
                        </div>
                    </el-card>

                </el-col>
            </el-row>



        </div>
    </div>
</template>

<script>
export default {

    name: "ModelUse",
    baseURL:'http://localhost:8080',
    data() {
        return {
            option1:{
                legend: {},
                tooltip: {},
                dataset: {
                    source: [
                        ['dataset', '1', '2', '3', '4','5','6','7','8','9','10'],
                        ['稳定段总推进力均值/4', 15713.91974/4, 15713.91974/4,15713.91974/4,15713.91974/4,15713.91974/4,15713.91974/4,15713.91974/4,15713.91974/4,15713.91974/4,15713.91974/4,],
                        ['稳定段刀盘扭矩均值', 2942.392641, 2942.392641,2942.392641,2942.392641,2942.392641,2942.392641,2942.392641,2942.392641,2942.392641,2942.392641,],
                        ['稳定段推进速度均值*40', 60.83314267*40, 60.83314267*40,60.83314267*40,60.83314267*40,60.83314267*40,60.83314267*40,60.83314267*40,60.83314267*40,60.83314267*40,60.83314267*40,]
                    ]
                },

                xAxis: [
                    {type: 'category', gridIndex: 0},
                ],
                yAxis: [
                    {gridIndex: 0},
                ],
                grid: [
                    {top: '15%'}
                ],
                series: [
                    // {name:['稳定段总推进力均值','稳定段刀盘扭矩均值','稳定段推进速度均值']},
                    // These series are in the first grid.
                    {type: 'bar', seriesLayoutBy: 'row'},
                    {type: 'bar', seriesLayoutBy: 'row'},
                    {type: 'bar', seriesLayoutBy: 'row'},
                ]
            },

            TableData: [
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },
                {   a:"302.53231",	b:"0.722609417",c:"7.00694437",
                    d:"7.51E-06",	e:"44.57949944",f:"0.085447488",g:"1504.349398",
                    h:"68422.44789",i:"1108.1",	j:"37180.52414",k:"177.8853195",l:"137.1489792",m:"4.814581641",
                    n:"0.700421557",o:"13971.11312", p:"846007.9146",q:"33.88139648",r:"36.11885989",
                    s:"142.2444509",t:"27.57576434",u:"3.350141072",v:"6.40E-06",w:"2.671452014",x:"2.09E-07",
                    y:"2.754804826",z:"3.04E-05", aa:"15713.91974/4",	ab:"2942.392641",ac:"60.83314267"
                },

                // {a:309.4555359	b:0.100175663	c:7.028488191
                // d:1.05E-05	e:48.8787618	f:0.032418063	g:1517.904399	h:165850.5213	i:1121.75	j:90421.68534	k:173.6482447	l:183.2905059	m:5.20246795	n:1.760681307	o:13638.3333
                // p:1130633.471	q:36.56394043	r:86.84246076	s:362.2314168	t:35.287921	    u:3.344800091	v:2.57E-05	w:2.671141418	x:1.88E-07	y:2.754297702	z:3.17E-05
                // aa:16015.02828	ab:3013.518114	ac:67.05818797},
                // {a:305.6018483	b:0.243127045	c:4.970281394
                // d:0.093314109	e:45.34223137	f:0.003296093	g:856.2925883	h:133785.4725	i:455	j:47170.10345	k:124.9329666	l:808.3214782	m:5.310096788	n:1.185727967	o:9812.235286
                // p:4986156.524	q:26.45834961	r:34.53270376	s:94.9226237	t:16.92218613	u:3.250398882	v:0.000661013	w:2.672982176	x:1.48E-07	y:2.756069517	z:3.72E-05
                // aa:15891.69147	ab:3179.002699	ac:73.1904141},
                // a:303.1274119	b:0.906764907	c:5.341820574
                // d:0.204697395	e:45.00173581	f:0.002789098	g:1031.946	h:153288.6609	i:589.9833333	j:67650.99109	k:141.7925339	l:511.9884659	m:5.215185571	n:0.671760299	o:11136.38569
                // p:3158217.069	q:27.92825928	r:27.77185818	s:114.751061	t:19.0707756	u:3.243413552	v:0.001246344	w:2.672307849	x:1.17E-07	y:2.754524493	z:3.30E-05
                // aa:16218.16112	ab:3119.361978	ac:69.30692463
                // a:303.0936564	b:0.09766852	c:6.897054879
                // d:3.34E-05	e:48.26367188	f:0.018620891	g:2839.023092	h:324781.525	i:2058.583333	j:170193.967	k:191.9232244	l:291.9906878	m:10.08673391	n:1.888248156	o:15073.6502
                // p:1801153.883	q:69.56325684	r:89.12710206	s:310.0466349	t:112.6302245	u:3.200111604	v:0.000215051	w:2.671156629	x:9.24E-08	y:2.752615476	z:4.12E-05
                // aa:16051.47614	ab:3172.595804	ac:69.89331471
                // a:298.0348185	b:4.336870015	c:6.805638774
                // d:3.79E-05	e:48.29448764	f:0.000274559	g:1546.221094	h:349835.8559	i:1104.833333	j:178647.523	k:186.5909536	l:767.4769479	m:6.075668804	n:2.329215423	o:14654.85368
                // p:4734206.139	q:41.3411377	r:107.2662551	s:163.4570546	t:43.51274065	u:2.945725989	v:0.000189745	w:2.671755028	x:7.37E-08	y:2.755067285	z:3.34E-05
                // aa:18342.42524	ab:3013.220918	ac:66.58043495
                // a:301.2374613	b:0.936832494	c:7.010385418
                // d:8.49E-05	e:48.17035586	f:0.006288837	g:2191.527584	h:112187.536	i:1615.016667	j:62092.02557	k:206.3208913	l:82.17921312	m:7.395469554	n:1.192370527	o:16204.44307
                // p:506925.1459	q:51.85096436	r:59.3000547	s:133.2443329	t:62.53347349	u:3.328995204	v:0.000271358	w:2.671550536	x:4.39E-08	y:2.756188814	z:3.39E-05
                // aa:17358.14431	ab:2657.163266	ac:63.93757212
                // a:331.0194834	b:0.000879628	c:5.605534347
                // d:0.32802752	e:44.57219315	f:0.004632794	g:250.7810354	h:10256.44736	i:140.5833333	j:1767.449713	k:0.201099538	l:0.000596898	m:0.204219833	n:0.056525371	o:15.79435803
                // p:3.681982735	q:1.212561035	r:2.124297094	s:47.06181844	t:0.002172511	u:3.288464793	v:0.00014476	w:2.682049561	x:4.17E-08	y:2.757298438	z:3.38E-05
                // aa:12261.25375	ab:1370.768179	ac:32.26763359
                // a:323.1727437	b:0.988521539	c:3.472453229
                // d:2.218166562	e:44.88375282	f:0.088702937	g:343.5049021	h:1281.282486	i:122.0333333	j:3058.050575	k:35.21604897	l:574.185468	m:5.444280247	n:58.60132322	o:2591.373033
                // p:4403935.026	q:28.44273682	r:1813.919187	s:42.03963928	t:40.02251086	u:3.303772799	v:0.000127522	w:2.682276726	x:6.31E-08	y:2.758061989	z:3.46E-05
                // aa:16975.58267	ab:3200.057552	ac:70.48208008
                // a:324.7535706	b:0.051352176	c:6.410623821
                // d:1.27E-05	e:50.33774605	f:0.135726225	g:1436.069419	h:87026.80087	i:967.8666667	j:38784.96437	k:163.3318863	l:147.1976805	m:5.979291765	n:1.229931823	o:12828.08646
                // p:907993.4818	q:38.32781982	r:50.34760717	s:101.1697266	t:54.74128674	u:3.302249622	v:8.78E-05	w:2.678292338	x:5.82E-08	y:2.757578786	z:3.16E-05
                // aa:17423.11741	ab:3066.926265	ac:65.59021875
            ],

            TestHeader:[
                { key:"a" ,label:"上升段撑靴压力均值"},

                { key:"b" ,label:"上升段撑靴压力方差"},

                { key:"c" ,label:"上升段刀盘转速均值"},

                { key:"d" ,label:"上升段刀盘转速方差"},

                { key:"e" ,label:"上升段刀盘刹车压力均值"},

                { key:"f" ,label:"上升段刀盘刹车压力方差"},

                { key:"g" ,label:"上升段刀盘扭矩均值"},

                { key:"h" ,label:"上升段刀盘扭矩方差"},

                { key:"i" ,label:"上升段刀盘功率均值"},

                { key:"j" ,label:"上升段刀盘功率方差"},

                { key:"k" ,label:"上升段推进压力均值"},

                { key:"l" ,label:"上升段推进压力方差"},

                { key:"m" ,label:"上升段贯入度均值"},

                { key:"n" ,label:"上升段贯入度方差"},

                { key:"o" ,label:"上升段总推进力均值"},

                { key:"p" ,label:"上升段总推进力方差"},

                { key:"q" ,label:"上升段推进速度均值"},

                { key:"r" ,label:"上升段推进速度方差"},

                { key:"s" ,label:"上升段推进位移均值"},

                { key:"t" ,label:"上升段推进位移方差"},

                { key:"u" ,label:"上升段主机皮带机转速均值"},

                { key:"v" ,label:"上升段主机皮带机转速方差"},

                { key:"w" ,label:"上升段桥架皮带机转速均值"},

                { key:"x" ,label:"上升段桥架皮带机转速方差"},

                { key:"y" ,label:"上升段转渣皮带机转速均值"},

                { key:"z",label:"上升段转渣皮带机转速方差"},

                { key:"aa" ,label:"稳定段总推进力均值"},

                { key:"ab", label:"稳定段刀盘扭矩均值"},

                { key:"ac",label:"稳定段推进速度均值"}



            ],

            /**
             *特征数据提取结果
             */
            ResultHeader:[
                { key:"a" ,label:"稳定段总推进力"},
                { key:"b" ,label:"稳定段刀盘扭矩"},
                { key:"c" ,label:"稳定段推进速度"},
            ],

            /**
             *特征数据提取结果
             */
            forecastResult:[
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
                {
                    a:"15713.91974",
                    b:"2942.392641",
                    c:"60.83314267"
                },
            ],

            name: localStorage.getItem('ms_username'),

            /**
             * 上传文件列表
             */
            fileList: [],

            message:"",

            totalNumber: 100,

            /**
             * 计数流程走到哪一步
             */
            number:1
        };
    },

    mounted() {
        let myChart1=this.$echarts.init(document.getElementById('echart1'));
        myChart1.setOption(this.option1);
    },

    methods: {

        handleRemove(file, fileList) {
            console.log(file, fileList);
        },
        handlePreview(file) {
            console.log(file);
        },
        handleExceed(files, fileList) {
            this.$message.warning(`当前限制选择 1 个文件，
            本次选择了 ${files.length} 个文件，
            共选择了 ${files.length + fileList.length} 个文件`);
        },
        beforeRemove(file, fileList) {
            return this.$confirm(`确定移除 ${ file.name }？`);
        },

        beforeAvatarUpload(file){
            var FileExt = file.name.replace(/.+\./, "");
            if (['zip'].indexOf(FileExt.toLowerCase()) === -1){
                this.message="文件格式有误，请重新上传"
                return false;
            }
            this.message="上传中,请稍等"
        },

        /**
         * 上传一个zip，后端返回特征数据提取结果一个10*27的表格数据
         * @param file
         */
        uploadZip(file)
        {
            this.number=1;//每次调用重置
            this.number++;
            let selectedFile=file;
            console.log(selectedFile);
            let name = selectedFile.name; //选中文件的文件名
            let size = selectedFile.size; //选中文件的大小

            console.log("文件名:" + name + "大小:" + size);

            this.$http.post(this.publicPath+'api/上传zip文件包',{file})
            .then(function(response) {
                this.$refs.refFile.clearFiles();
                this.featureDataResult(response);
                console.log('success');
            })
            .catch(function(response){
                console.log(response);
                this.number=1;//默认失败重新上传
            });
        },


        /**
         * 将预处理结果呈现并且发送请求进行模型预测
         * 后端传递一个10*27的表格数据
         */
        featureDataResult(res)
        {
            this.number++;
            console.log(res);
            console.log(res.data());
            // this.TableData=res.data();
            let temp=JSON.stringify({"特征数据提取结果":res})
            this.$http.post(this.base+'api/获取模型预测结果',{temp})
            .then(function(res) {
                this.modelPredictionResults(res);
            })
            .catch(function(res) {
                console.log(res);
                console.log(res.data());
                this.number=1;//默认失败重新上传
            })
        },

        /**
         * 将预测结果呈现并且充值进度条
         */
        modelPredictionResults(res)
        {
            this.number=1;
            console.log(res);
            console.log(res.data());
            this.TableData1=res.data();
        }

    }
}
</script>

<style scoped>


.upload-demo{

}


.ellipse{
    width: 250px;
    height: 150px;
    margin: 50px;
    background: #5daf34;
    border-radius: 50% / 50%;
    display: flex;
    align-items: center;        /*竖直居中 垂直居中*/
    justify-content: center;    /*水平居中*/

}

.models{
    font-weight: bolder;
    color: #222222;
    font-size: 20px;
}

.el-upload{
    width: 80px;
    height: 100px;
}

.el-upload__text
{
    width: 80px;
    height: 100px;
}

.el-upload__input
{
    width: 80px;
    height: 100px;
}

.el-card{
    background: #c7ddef;
}

.clearfix{
    font-weight: bolder;
}
.user-info {
    display: flex;
    align-items: center;
    padding-bottom: 20px;
    border-bottom: 2px solid #ccc;
    margin-bottom: 20px;
    font-weight:bolder;
}


.user-info-cont {
    padding-left: 50px;
    flex: 1;
    font-size: 14px;
    color: #999;
}

.user-info-cont div:first-child {
    font-size: 30px;
    color: #222;
}

.user-info-list {
    font-size: 14px;
    color: #999;
    line-height: 25px;
}

.user-info-list span {
    margin-left: 70px;
}

.mgb20 {
    margin-bottom: 20px;
}

.todo-item {
    font-size: 14px;
}

.todo-item-del {
    text-decoration: line-through;
    color: #999;
}

.schart {
    width: 100%;
    height: 300px;
}

</style>